Tekla Open API Reference for Tekla Structures 2025
LogicalWeld Constructor
 Creates a new logical weld instance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LogicalWeld(
	BaseWeld MainWeld
)
Public Sub New (
	MainWeld As BaseWeld
)
Parameters
MainWeld
Type: Tekla.Structures.Model.BaseWeld
The main weld for the logical weld.
See Also
Reference
LogicalWeld Class
Tekla.Structures.Model Namespace